# Pandas

The Pandas library is used for data manipulation and analysis.

Pandas consist of data structures and functions to perform efficient operations on data.

Pandas is well-suited for working with tabular data, such as spreadsheets or SQL tables.

1) Series- 1D data it has just one column with other column being the index
   
2) Dataframe- 2D data it has multiple columns

### First step is to import pandas

In [7]:
import pandas as pd

## Series

In [12]:
#creating a series
ser1=pd.Series(data=[98,100,45,24])
ser1

0     98
1    100
2     45
3     24
dtype: int64

In [14]:
#Alloting index as names instead of leaving it blank
ser2=pd.Series(data=[98,100,45,24],index=['Spoorthi','Tiya','Annie','Marie'])
ser2

Spoorthi     98
Tiya        100
Annie        45
Marie        24
dtype: int64

In [16]:
#to check what we created 
type(ser1)

pandas.core.series.Series

In [18]:
#to check dimension
ser1.ndim

1

In [20]:
#to check size
ser1.size

4

In [22]:
#to access an element 
ser2['Spoorthi']

98

In [24]:
#to access first 3 elements
ser2['Spoorthi':'Annie']

Spoorthi     98
Tiya        100
Annie        45
dtype: int64

In [28]:
#to access just Spoorthi and Marie
ser2[['Spoorthi','Marie']]

Spoorthi    98
Marie       24
dtype: int64

In [32]:
#maximum 
ser2.max()

100

In [34]:
#average
ser2.mean()

66.75

In [36]:
#minimum
ser2.min()

24

In [38]:
#median
ser2.median()

71.5

In [42]:
#to check numbers greater than 95, we get true if it is greater than 95 else false
ser2>95

Spoorthi     True
Tiya         True
Annie       False
Marie       False
dtype: bool

## Dataframe

In [98]:
#create a dictionary
dic1={'Names':['Spoorthi','Nagareddy','Annie','Marie'],'Age':[24,54,25,27],'Gender':['Female','Male','Female','Female'],'Location':['USA','India','Germany','Russia']}
dic1

{'Names': ['Spoorthi', 'Nagareddy', 'Annie', 'Marie'],
 'Age': [24, 54, 25, 27],
 'Gender': ['Female', 'Male', 'Female', 'Female'],
 'Location': ['USA', 'India', 'Germany', 'Russia']}

In [96]:
#to create a dataframe
df=pd.DataFrame(dic1)
df

       Names  Age  Gender Location
0   Spoorthi   24  Female      USA
1  Nagareddy   54    Male    India
2      Annie   25  Female  Germany
3      Marie   27  Female   Russia

In [100]:
#to change the index from 0-3 to 1-4
df1=pd.DataFrame(dic1,index=range(1,5))
df1

       Names  Age  Gender Location
1   Spoorthi   24  Female      USA
2  Nagareddy   54    Male    India
3      Annie   25  Female  Germany
4      Marie   27  Female   Russia

In [102]:
#to check number of rows and column
df.shape

(4, 4)

In [104]:
#to check dimension
df.ndim

2

In [106]:
#to check size
df.size

16

In [108]:
#to get column names
df.columns

Index(['Names', 'Age', 'Gender', 'Location'], dtype='object')

In [110]:
#sort age in ascending order
df.sort_values('Age')

       Names  Age  Gender Location
0   Spoorthi   24  Female      USA
2      Annie   25  Female  Germany
3      Marie   27  Female   Russia
1  Nagareddy   54    Male    India

In [112]:
#to drop a column
df.drop(columns='Gender')

       Names  Age Location
0   Spoorthi   24      USA
1  Nagareddy   54    India
2      Annie   25  Germany
3      Marie   27   Russia

In [114]:
#to drop 2 columns
df.drop(columns=['Gender','Location'])

       Names  Age
0   Spoorthi   24
1  Nagareddy   54
2      Annie   25
3      Marie   27

In [116]:
#to drop columns permanently
df.drop(columns=['Gender','Location'],inplace=True)

In [118]:
df

       Names  Age
0   Spoorthi   24
1  Nagareddy   54
2      Annie   25
3      Marie   27